{
  "title": "Peach Coffee Cake",
  "badge": "For Twelve",
  "image": "peach-coffee-cake",
  "cost": [
    "$9 Total",
    "$0.75 / Serving"
  ],
  "overview": "<p>This is adapted from the apple cake often served during Rosh Hashanah. It’s simple and wonderful for dessert, with tea, or as a sweet breakfast. The juicy peaches add a ton of flavor to this simple cake. If you buy peaches in season, the cost can be quite reasonable.</p>",
  "ingredients": [
    {
      "items": [
        "6 peaches, pitted and cut into 8 slices each",
        "1 tsp cinnamon",
        "½ lemon, juiced",
        "2 cups all-purpose flour",
        "2 tsp baking powder",
        "½ lb unsalted butter (2 sticks), at room temperature",
        "1⅓ cups brown sugar",
        "⅛ tsp salt",
        "2 large eggs",
        "1 tsp vanilla"
      ]
    }
  ],
  "steps": [
      "Heat the oven to 350°F.",
      "Spread the coconut into a thin, even layer on a cookie sheet. Place it in the oven for 5 to 8 minutes, until it’s light brown, toasty, and aromatic.",
      "Melt the butter in a heavy-bottomed saucepan over low heat. Once it’s melted, leave it to cool in the pan for a few minutes.",
      "In a medium-sized bowl, stir together the flour, salt, and baking soda.",
      "In another bowl, beat the brown sugar and melted butter together for about 2 minutes, until they’re smooth. Add the eggs and vanilla and beat for about 5 minutes, until the mixture lightens in color. Mix the flour mixture with the brown sugar mixture, a third at a time, until it forms a dark brown, homogeneous mass. Add the chocolate chips and coconut and stir until just combined.",
      "Place the dough in the fridge for 20 minutes.",
      "Afterwards, scoop tablespoons of dough onto a lightly buttered cookie sheet, leaving large spaces between each cookie so they have space to spread out. I usually do about 6 cookies per sheet. Just before putting the cookies into the oven, sprinkle them with salt.",
      "Let the cookies bake for 8 to 10 minutes. After you take them out of the oven, leave them on the sheet to set for 2 minutes, then move them to plates to cool further. Don’t stack the cookies until they’ve cooled fully.",
      "Continue the process until the dough is gone.",
      "Store the finished cookies in an airtight container."
  ]
}
