{
  "title": "A Note on $4/Day",
  "image": "shells",
  "content": "<p>I designed these recipes to fit the budgets of people living on SNAP, the US program that used to be called food stamps. If you’re on SNAP, you already know that the benefit formulas are complicated, but the rule of thumb is that you end up with $4 per person, per day to spend on food.</p><p>This book isn’t challenging you to live on so little; it’s a resource in case that’s your reality. In May 2014, there were 46 million Americans on food stamps. Untold millions more—in particular, retirees and students—live under similar constraints.</p><p>The costs for each recipe are based on two sources. For the pantry items on the following pages, I collected prices from four grocery stores in Inwood, a relatively low-income neighborhood on the north tip of Manhattan. For specific spices and a wider variety of fruits and vegetables, I looked at online grocery stores or nationwide averages collected by the Bureau of Labor Statistics.</p><p>The prices for fruits and vegetables assume that they’re roughly in season, when you can get the best deals. This means, unfortunately, that you’ll pay a lot more if you want to make peach coffee cake in February. I talk more about shopping in season on the following pages.</p><p>The estimates are, by necessity, a snapshot of place and time. Costs will vary in other cities, other neighborhoods, even just other stores. Please think of the numbers as a guideline, not a guarantee.</p><p>More than in most cookbooks, my recipes are flexible and encourage substitution based on availability, price, and personal tastes. A strict budget requires flexibility and a willingness to say, “that’s a good deal this week, so it’s what I’ll be cooking!” Don’t worry, you’ll pick up the tricks quickly.</p><p>A few recipes call for fancy kitchen equipment, but in my work with low-income families in New York, I’ve found that items like blenders, food processors, and electric mixers are fairly common. I did not, however, attempt to tackle the very real situation of people who have no kitchen, no equipment, and no space to prepare food. I simply cannot hope to do those issues justice within the bounds of one cookbook. Let’s all agree that we need to keep striving to address those other issues that make it difficult for so many people to eat well.</p>"
}