{
  "title": "Tips for Eating and Shopping Well",
  "image": "salsa-1",
  "content": "<h2>Buy foods that can be used in multiple meals</h2><p>Versatile ingredients save meals. If you buy flour, you can make tortillas, roti, scones, and pancakes. If you buy yogurt (or make your own), you can have it with fruit, make raita and tzatziki, or use it in a drink. Need I even mention the versatility of garlic or lemons? If you always keep them around, you can make anything else taste fantastic.</p><h2>Buy in bulk</h2><p>Buying larger amounts usually brings the price down. When you’re working within a tight budget, you won’t always be able to afford to shop for the future, but do it when you can. And, of course, keep storage in mind: If the item will go off before you can finish it, get the smaller size. If you buy versatile ingredients in slightly larger amounts, you’ll be able to use them quickly but still make diverse meals.</p><h2>Start building a pantry</h2><p>If possible—and admittedly this can be difficult for people living on their own—reserve part of your budget to buy one or two semi-expensive pantry items each week. Things like olive oil, soy sauce, and spices are pricey at first, but if you use just a little with each recipe, they go a long way. With turmeric, coriander, cumin, and fresh ginger root, you’ll suddenly have a world of flavor on your shelf. In a few pages, I’ll suggest specific items to add to your pantry.</p><h2>Think weekly</h2><p>Each week, mix things up by buying different varieties of staple foods like grains and beans. This week, you might have oatmeal every morning with black bean chili or black bean tacos later in the day, but next week you’ll have yogurt for breakfast and hummus or chana masala for lunch and dinner. If you have time to shop frequently, pick up smaller amounts of produce every couple of days to ensure everything is fresh. It’s a lot more inspiring to pull crisp greens out of the fridge than to unstick a wilted mess from the bottom of the veggie drawer. If you can’t shop as often, consider getting canned or frozen versions of whichever vegetables you won’t use immediately.</p><h2>Think seasonally</h2><p>During their local growing season, fruits and vegetables are generally cheaper and definitely tastier than outside of season. You’ll notice that orange prices shoot up during the summer, yet what’s available is drab and flavorless. But oranges are abundant in December and January, the peak of their season, and that’s reflected in the price. At the end of summer, you can get bags of zucchini for next to nothing. Brussels sprouts are also very seasonal, coming on sale around Thanksgiving. Enjoy as much of the summer and fall produce as possible, because you’ll be more limited in the winter. Then again, simmering and roasting winter vegetables is a fine way to warm up your house, and tough winter roots are easy to store. In addition, winter is a great time to search for deals on canned and frozen produce. Seasons for fruits and vegetables vary depending on where you live, so consult a local guide to growing seasons and use it to shop for the best deals.</p><h2>More vegetables means more flavor</h2><p>Nothing livens up a bowl of rice like summer squash and corn! Vegetables make the best sauces: they’re earthy, bright, tart, sweet, bitter, savory, rich. Give them a treasured spot at the top of your grocery list and you’ll never be bored.</p><h2>Always buy eggs</h2><p>With these babies in your fridge, you’re only minutes away from a satisfying meal. Scramble an egg with leftovers or drop an egg on top of a salad or a plate of stir-fried vegetables, and deliciousness is guaranteed.</p><h2>Buy expensive eggs if you can</h2><p>More expensive eggs are usually worth the money—they taste so much better than cheap eggs. Even at $4 a dozen, you’re still only paying 33 cents an egg. Really fresh eggs, like those from a farmers’ market, also make a big difference in flavor.</p><h2>Be careful with undercooked eggs</h2><p>Very rarely, raw eggs can be infected with salmonella. Many classic recipes, from mayonnaise to eggnog to Caesar dressing, are prepared with raw egg yolk, but technically only a hard-cooked egg is guaranteed to be free of salmonella. Consequently, raw or runny eggs are not recommended for infants, the elderly, pregnant women, or anyone with a weakened immune system.</p><h2>Buy fresh bread</h2><p>Try to buy fresh loaves of interesting bread from an independent bakery or the bakery in your grocery store. Although fresh loaves don’t last as long as sliced bread, they’re much more enjoyable, and you can use the old stuff to make panzanella or croutons or breadcrumbs to top other dishes. Later in the day, many independent bakeries offer deep discounts on bread they would otherwise have to throw out.</p><h2>Don’t buy drinks</h2><p>All the body needs drink-wise is water. Except for milk, most packaged drinks are overpriced and deliver a lot of sugar without filling you up the way a piece of fruit or a bowl of yogurt does. If you want a special drink, make agua fresca, a smoothie, or tea.</p><h2>Get creative with wilted vegetables</h2><p>Sometimes you forget a pepper or bunch of spinach in the back of the fridge. Although wilted veggies might not remain fit for a salad, they’ll still be wonderful in any dish that calls for sautéed, grated, or baked vegetables. Just cut off any actual rot. You can also use them in broth.</p><h2>Make your own broth and stock</h2><p>In almost any savory recipe that calls for water, homemade broth or stock would be better. To make broth, start by saving any vegetable bits that you chop off and would normally throw away, like onion tops, the seedy parts of peppers, and the ends of carrots. Store them in the freezer until you have a few cups, then cover them with water, bring to a boil, and simmer on low heat for a few hours. Add salt to taste, and you have broth! To make a hearty stock, do the same with leftover bones or scraps of meat (preferably all the same kind of meat). Since you’re using stuff you’d otherwise throw away, broth and stock are effectively free.</p><h2>Treat your freezer with respect</h2><p>A freezer can be a great friend for saving time by letting you prepare large batches of food at once. Cooking dried beans takes a while, so make more than you need, then freeze the rest. Another great trick I learned from a reader is to dice a whole package of bacon, fry it, then freeze it in small parcels. This makes it easy to add a small amount of bacon to a dish without the temptation of using the whole package.</p><h2>Turn chicken skin into schmaltz</h2><p>Schmaltz is rendered chicken fat that you can use like butter. Buy chicken that still has its skin, then trim the skins and lay them in a pan on low heat. Add a cup or so of water and simmer until the fat releases from the skin and the water cooks off. Let the fat cool, then throw away the skins and pour the fat into a glass jar. Store in the fridge.</p><h2>Buy a pepper grinder</h2><p>Seriously, banish pre-ground pepper from your life; it loses all flavor when it sits around. Fresh pepper creates pops of intense flavor on the tongue and lights up bland dishes. One of the most popular dishes in Rome is just pasta with butter and pepper: give it a try!</p>"
}