{
  "title": "Pantry Basics",
  "image": "cans-2",
  "content": "<p>With these commonly available items in your pantry, you can have a wide variety of meals on the table within minutes. Keeping a well stocked pantry is the key to easy, fast cooking at home. When you’re living on a budget, building up supplies does take time, but just keep adding each week and you’ll get there in time.</p><h2>Vegetables</h2><p>Vegetables can (and should!) be the base of most meals. Other than greens, which should be used quickly, these can be stored for a few days to a few weeks. Try each vegetable as it hits peak season and goes on sale.</p><ul><li>garlic</li><li>onions</li><li>carrots</li><li>celery</li><li>peppers</li><li>broccoli</li><li>tomatoes</li><li>hot peppers</li><li>hardy greens</li><li>salad greens</li><li>potatoes</li><li>sweet potatoes</li><li>cauliflower</li><li>winter squash</li></ul><h2>Fruits</h2><p>Citrus fruits are cooking essentials and they keep well. The zest and juice can liven up just about any dish and they always make a great dressing. Bananas, apples, and melons are great quick snacks, but try every fruit you can afford! Remember, almost all fruits and vegetables have a season, so savor them at their freshest and cheapest.</p><ul><li>apples</li><li>melons</li><li>oranges</li><li>limes</li><li>lemons</li><li>bananas</li></ul><h2>Dairy</h2><p>Butter is just as good to cook with as it is on toast. These are the cheeses I like, but buy what your taste, budget, and local availability alllow.</p><ul><li>butter</li><li>milk</li><li>yogurt</li><li>queso fresco</li><li>Romano or Parmesan</li><li>sharp cheddar</li><li>mozzarella</li></ul><h2>Protein</h2><p>Meat isn’t the only protein! The items below are cheap, easily stored, and have multiple uses. Be aware that most fish at the grocery store has previously been frozen and was merely thawed for display. There’s no harm in buying it frozen and thawing it yourself.</p><ul><li>eggs</li><li>dried beans</li><li>lentils</li><li>tofu</li><li>nuts</li><li>peanut butter</li></ul><h2>Grains</h2><p>Flour is so inexpensive, and once you have a few basics at hand, most baked goods are a cinch to make. There’s great variety in whole grains. Substitute them for rice, toss them in a salad, or add them to soup.</p><ul><li>bread</li><li>tortillas</li><li>pasta</li><li>all-purpose flour</li><li>whole-wheat flour</li><li>oats</li><li>popcorn</li><li>short-grain rice</li><li>long-grain rice</li><li>brown rice</li><li>cornmeal</li><li>dried whole grains</li></ul><h2>Canned vegetables</h2><p>Plenty of vegetables are good when canned, so remember to compare prices between fresh, frozen, and canned. The canned versions are fantastic in sauces. Just be aware that canned foods are often very salty, so you might want to rinse them, except for canned tomatoes.</p><ul><li>whole tomatoes</li><li>tomato paste</li><li>whole corn</li></ul><h2>Frozen fruits and vegetables</h2><p>Fresh berries can be expensive, but the frozen ones often go on sale and are great for smoothies. Frozen veggies are quick to add to soups and rice dishes. Again, compare prices to see whether frozen is the best value.</p><ul><li>berries</li><li>peas</li><li>green beans</li><li>corn</li></ul><h2>Flavor and cooking</h2><p>You can explore an extraordinary number of cuisines with these items. They add depth and excitement to the most simple dishes.</p><ul><li>olive oil or vegetable oil</li><li>wine vinegar</li><li>anchovies</li><li>sardines</li><li>olives</li><li>fish sauce</li><li>coconut milk</li><li>miso paste</li><li>mustard</li><li>soy sauce</li><li>chili sauce</li><li>brown sugar</li><li>fresh herbs</li><li>dried spices</li></ul><h2>Treats that go a long way</h2><p>Although these items can be expensive, a little goes a long way; when you can, pick up an item or two and enjoy the results.</p><ul><li>dried fruits</li><li>dried mushrooms</li><li>frozen shrimp</li><li>maple syrup</li><li>bacon</li><li>vanilla</li><li>cocoa powder</li></ul><h2>Spices</h2><p>I have a whole page on spices, but they can be a sticking point: no food value, and they sometimes have a high sticker price. However, one small bottle lasts many meals, so invest in them whenever you can.</p>"
}