{
  "chapter": "snacks-sides-small-bites",
  "title": "Cornmeal Crusted Veggies",
  "badge": "For Four",
  "image": "cornmeal-crusted-veggies",
  "cost": {
    "total": "$2.60",
    "each": "$0.65",
    "units": "Serving"
  },
  "overview": "<p>These are kind of like having veggie french fries. The cornmeal makes them super crunchy, and they’re great with a dipping sauce. Might I suggest peanut sauce? This breading process can be done with almost any vegetable; some of my favorites include zucchini wedges, bell peppers, and cooked winter squash. It’s sort of like fried green tomatoes or okra, but this baked version skips the expense and mess of the oil, yet keeps the crunch.</p>",
  "ingredients": [
    {
      "items": [
        "½ lb green beans, stems cut off",
        "½ cup all-purpose flour",
        "2 eggs",
        "¼ cup milk",
        "1 cup cornmeal",
        "1 tsp salt",
        "1 tsp black pepper",
        "1 tsp paprika",
        "½ tsp garlic powder"
      ]
    },
    {
      "label": "Alternatives",
      "items": [
        "zucchini",
        "bell pepper sticks",
        "winter squash",
        "cauliflower florets",
        "broccoli florets",
        "okra",
        "carrot sticks"
      ]
    }
  ],
  "steps": [
      "Heat the oven to 450°F.",
      "Set up your breading station! On one plate, spread out the flour. Crack both eggs into a bowl, add the milk, and mix lightly with a fork. On another plate, spread the cornmeal, salt, black pepper, paprika, and garlic powder. Mix the plate with your fingers.",
      "Spread a small amount of oil or butter across a baking sheet.",
      "A few at a time, take the green beans and dredge them in the flour. Next, transfer the flour-covered beans to the egg mixture. Cover the beans lightly with egg mixture, being careful to shake off any excess egg. Then transfer to the cornmeal mixture and coat them evenly.",
      "Carefully spread the crusted green beans onto the baking sheet. Repeat until you’ve done them all. If you run out of any of the three mixtures, just mix up a bit more.",
      "Bake for 10 to 15 minutes, until golden and crispy. Enjoy hot with your favorite dipping sauce!",
      "Pictured are bell peppers and green beans."
  ]
}
