{
  "chapter": "staples",
  "title": "Fresh Pasta",
  "badge": "For One Large Entree",
  "image": "fresh-pasta-3",
  "cost": [
    "$0.35 Total",
    "$0.35 / Serving"
  ],
  "overview": "<p>When a reader, Jeanne, asked for a good pasta dish, I decided to show her how to create it from scratch. Sure, making pasta by hand requires elbow grease and a good rolling pin, but you’ll be surprised at how simple, cheap, and tasty it is. If an Italian grandmother can do it, so can you! Because fresh pasta is so wonderful, the sauce doesn’t need to be complicated. I love this with tomato sauce and a little cheese.</p>",
  "ingredients": [
    {
      "items": [
        "¾ cup all-purpose flour or bread flour",
        "1 egg",
        "olive oil or vegetable oil"
      ]
    }
  ],
  "steps": [
      "Multiply this recipe by the number of people you are serving, maybe a bit less. The stated quantities are a useful ratio, but produce big portions.",
      "Put the flour in a bowl. Make a crater in the center of the flour and crack the egg into it. Mix with your hands. The egg takes a while to release all its moisture, so don’t panic if things are dry at first. If, after mixing for about a minute, the dough still seems excessively dry, add a teaspoon of water. Keep mixing until you develop a stiff dough that is quite dry. The dryness makes it easier to roll out and keeps the noodles from sticking together when you cook them.",
      "Place the dough in a lightly oiled bowl covered with a moist towel or plastic wrap for 1 or 2 hours.",
      "Once an hour (or more) has passed, you’ll notice a marked change in the dough. Now that the egg has released its moisture, you’ll have a pale yellow, smooth, pliable dough. Knead again to create a smooth ball.",
      "Tear or slice the dough into manageable pieces—usually as many as the number of people you’re feeding. Dust your countertop or cutting board heavily with flour, then use a rolling pin to make the dough as thin as you can. Rolling it out will take a while because it’s tough and stretchy. Try to get it thin enough to see light through. The thinner the dough, the quicker it will cook, but don’t make the dough so thin that it tears.",
      "By the time the pasta is rolled out, it should be dry enough to avoid sticking to itself. If it’s still moist, leave it to sit for a few minutes.",
      "Slice into whatever size of noodles you like. It’s easy to make the noodles a consistent size if you fold the dough over itself a few times first. Shake the cut noodles on a tray with a bit of flour to keep them from sticking.",
      "Boil in heavily salted water. Fresh pasta cooks in as little as 30 seconds if the noodles are thin. It’s ready when it changes color and starts to float.",
      "You can keep uncooked pasta for up to 2 days in the fridge."
  ]
}
