{
  "chapter": "staples",
  "title": "Rainbow Rice 3 Ways",
  "badge": "For Two",
  "image": "rainbow-rice",
  "cost": {
    "total": "$1.50",
    "each": "$0.75",
    "units": "Serving"
  },
  "overview": "<p>Here are three quick ways to make plain rice a little more exciting. An early reader, Charles, said he loves rice with vegetables, but these treatments work for grains other than rice as well—everything from quinoa to barley to farro. Vegetables are a great way to liven up the usual rice and beans.</p><p>TODO(layout): Four separate recipes and ingredients.</p>",
  "ingredients": [
    {
      "items": [
        "1 cup rice",
        "2 cups water",
        "salt"
      ]
    },
    {
      "label": "Red Rice",
      "items": [
        "1 cup canned tomatoes, puréed"
      ]
    },
    {
      "label": "Orange Rice",
      "items": [
        "1 cup canned winter squash, pumpkin, or sweet potato, puréed"
      ]
    },
    {
      "label": "Green Rice",
      "items": [
        "1 cup frozen spinach, beet greens, chard, or fresh parsley"
      ]
    }
  ],
  "steps": [
      "To make normal rice, pour 2 cups of water into a pot with 1 cup of uncooked rice and two pinches of salt. That’ll be enough for two generous portions, or three or four smaller servings. With the lid off, bring to a low boil over medium heat, then turn the heat down to low and put the lid on slightly askew, so that the steam can escape. Cook for about 20 minutes, until the water is all gone.",
      "Red Rice: Stir the tomatoes with 1½ cups of water, then pour it into a pot with 1 cup of uncooked rice and two pinches of salt. Cook as above.",
      "Orange Rice: Stir the squash, pumpkin, or sweet potato with 1½ cups of water, then pour it into a pot with 1 cup of uncooked rice and two pinches of salt. (You can also use frozen, boiled, or sautéed squash.) Cook as above.",
      "Green Rice: Chop up the spinach as much as you like. The more finely chopped, the more it will disperse into the rice. Cook normal rice, as above, for about 15 minutes, until most of the water is gone but not quite all. Mix the spinach into the rice. Cook with the lid off for the last 5 minutes. Adding the spinach at the end keeps it lush and bright, rather than the sad color of overcooked spinach."
  ]
}
