{
  "chapter": "flavor",
  "title": "Spices and Aromatics",
  "badge": "Ideas",
  "image": "spices-and-aromatics",
  "overview": "<p>So many of the recipes in this collection can be easily modified to your taste. Learning to cook with different spices, herbs, and aromatics will instantly elevate your cooking and open up new and interesting possibilities. Spices are expensive to buy, but since you use such small amounts, they end up costing pennies per recipe. If you’re able to shop around, look for inexpensive spices in bulk at ethnic markets.</p><p>Below, I’ve ranked what I feel are the most important seasonings, but if you already know what you like, please listen to yourself! I know that my sister would rank chipotle powder just under salt, so do as your heart commands.</p><h2>Chili Flakes</h2><p>Chili is a great choice if you like things a little spicy. I add just a dash of chili flakes to almost all savory dishes to give them a little more dimension. Plus, chili flakes are usually pretty cheap.</p><h2>Cumin or Cumin Seeds</h2><p>Cumin goes well with so many flavors, and is essential in Mexican and Indian cuisine.</p><h2>Curry Powder</h2><p>Curry powder is a bunch of south Asian spices blended together. I prefer to make my own out of individual spices, but if you’re new to curry, consider buying a blend to start out. If you love it, start buying the separate spices.</p><h2>Dried Oregano and Dried Thyme</h2><p>Both of these herbs are still tasty when dried. They add a lot of flavor to chili, soups, or roasted vegetables. However, don’t bother with dried basil, dried cilantro, or dried dill unless you particularly like them and can’t afford to get them fresh. They lose almost all their magic when dried.</p><h2>Cinnamon</h2><p>This is probably everyone’s favorite “sweet” spice. If you like baking, get some as soon as possible.</p><h2>Paprika and Smoked Paprika</h2><p>Paprika adds a bit of heat, although not nearly as much as chili flakes. Instead, it gives you a great mild pepper taste. Smoked paprika is my favorite way to get smoky flavors into a dish. These are by no means essential, but they’re lots of fun.</p><hr><p>Try the flavor combinations below on anything from rice to roasted chicken to vegetables. Mix them into butter, or add them to popcorn, toast, or vegetables. In short, experiment!</p><ul><li>lemon zest and garlic</li><li>oregano, cumin, and chili powder</li><li>cumin seeds, coriander seeds, and mustard seeds</li><li>onion, garlic, and ginger</li><li>anchovy, garlic, and chili</li><li>salt, pepper, and Romano or Parmesan</li><li>onion, chili, and fresh cilantro</li><li>sage, rosemary, and thyme</li><li>lemon, olives, and garlic</li><li>chipotle powder and lime</li><li>pickling spices</li><li>paprika and fresh dill</li><li>garlic and fresh parsley</li><li>fennel seeds and fresh parsley</li><li>orange, lemon, and lime zest</li><li>ginger, cinnamon, and black pepper</li><li>cardamom, coriander, and bay leaf</li><li>coconut, chili, and lime</li><li>scallions and fresh cilantro</li><li>garlic and fresh basil</li></ul><p>TODO(layout): 'Ideas' badge.</p>"
}
