{
  "title": "Croutons or Breadcrumbs",
  "badge": "Method",
  "image": "croutons-or-breadcrumbs-1",
  "overview": "<p>I am constantly haunted by the hard, several-day-old bread that I have neglected. Luckily there are plenty of delicious solutions that avoid the trash can. Croutons and breadcrumbs will keep for ages in a sealed container on the counter, and when you have them around you’ll find yourself using them everywhere and finding excuses to make a salad.</p>",
  "ingredients": [
    {
      "items": [
        "bread",
        "butter or vegetable oil as needed",
        "salt and pepper"
      ]
    }
  ],
  "steps": [
      "This is a method more than a recipe since you’ll have a random amount of bread. If making croutons, start by cutting the bread into cubes. If making breadcrumbs, mince the loaf with a knife, or just tear it apart, or throw small chunks of bread into a food processor. If the bread is too hard to cut, wrap it in a kitchen towel, sprinkle some water on the towel, and microwave for 20 to 30 seconds. This will restore just enough moisture to let you cut the bread easily.",
      "Choose a sufficiently large pan for the quantity of bread cubes or crumbs—or work in batches if you have a lot—and place it on the stovetop on medium heat. Add enough butter or vegetable oil to coat the bottom of the pan. I prefer the flavor of butter, but use whatever you have.",
      "Let the butter melt or the oil get hot. Add the bread and toss gently until coated. Let the bread sit for 2 minutes, then flip the pieces over. Keep tossing and turning until the bread is brown all over. Add oil or butter as needed and sprinkle with salt and pepper. It is basically impossible, unless you are very patient (which I am not) to get every side of the cubes browned, so just get them generally looking good and toasty and then take them off the heat.",
      "For breadcrumbs, if you like, you can go oil-free: just toast whole slices and then crush it into small pieces.",
      "Use the breadcrumbs or croutons immediately, or place them in a sealed container after letting them cooling off. Later, use them in salads or anything you want to add crunch to."
  ]
}
